# 物理的セキュリティ対策
→施設・設備などの環境管理や文書・記憶媒体などの管理、物理的に存在するものに対する管理

- **ゾーニング**：区画を分ける
- **入退出管理**：IDカードなどで入室を制限、記憶
  - **アンチパスバック**：利用者IDごとに入退室の時刻を記録することでカード操作なしの入退室を制限する仕組み
- **遠隔バックアップ**：遠隔地にバックアップ(災害対策)
- セキュリティワイヤ：危機をワイヤーでくくり、盗難防止(ケンジントンロックが有名)
- **USBキー**：固有の認証情報を持つ専用メモリ
- **廃棄**：危機を物理的に破壊、もしくはランダムビット列で全データ領域を上書き、破棄した危機からのデータ漏洩防止

## 内部情報の保護
- **耐タンパ性**：内部解析や改変したいする防御力

# 人的セキュリティ対策
- **人的セキュリティ**：人的な手続き・管理・運用ルールなどに対するセキュリティ
- **CISO**：最高情報セキュリティ責任者
- 組織における内部不正防止ガイドラインなどを参考に社内規定を策定・管理・監視

# 技術的セキュリティ対策
- 不正アクセス対策
  - パスワードクラック対策
  - クラッキング対策
    - 悪用されそうなポートを使えないようにしておく
    - アクセスログなどを定期的に確認する
- **マルウェア対策**：**ウイルス対策ソフト**
  - **パターンマッチング方式**：ウイルスの特徴部分をパターンとしてDBに保持、一致するものがあれば対応する、DBは定義ファイルと呼ばれ継続的に更新が必要
  - **ルールベース方式**、**静的ヒューリスティック法**：プログラムの中身を見てどんな動きをするか静的に解析する
  - **ルールベース方式**、**ビヘイビア法**：プログラムを動かい背見て怪しい動きがない稼働的に解析する
- **アップデート**：
  - **修正プログラム**：そのプログラムに不具合が見つかったとき、その不具合の解消や機能改善のために配布される
  - **パッチファイル**：修正プログラムのうち、プログラムを部分的に修正するためのもの、パッチ=つぎはぎに使う布
  - フォットフィックス：緊急性の高い深刻な脆弱性が発見されたときに出される修正プログラムで脆弱性の機器を回避することを第一としている
- **セキュアブート**：PC起動時に読み込まれるOSやドライバについてるディジタル署名を検証する
- **URLフィルタリング**：指定されたURLのコンテンツ閲覧を禁止する
- **電子透かし**：文書、静止画、動画なのどのコンテンツに埋め込む秘密データ、不正コピーやデータ改ざんなどへの対策
- 携帯端末セキュリティ：会社が社員に端末を持たせる場合や個人の端末を仕事に使う(**BYOD**)場合などでは**携帯端末に機密情報が記録される可能性がある**
- **ディジタルフォレンジックス**：電子機器に残る記録収集・分析し法的証拠とする手段や技術の総称
